polytechnic: /ˌpɒlɪˈteknɪk/|理工学院，工艺学院|a college or university offering courses in many technical or vocational subjects.|例句: He attended a polytechnic after secondary school. 他中学毕业后进入了一所理工学院。|近义词: institute of technology|反义词: university (in a liberal arts sense)|词性：n., adj.
polytheism: /ˈpɒlɪˌθiːɪzəm/|多神教|the belief in or worship of more than one god.|例句: Ancient Greeks practiced polytheism. 古希腊人信奉多神教。|近义词: multiple gods belief|反义词: monotheism|词性：n.
polytheistic: /ˌpɒlɪθiˈɪstɪk/|多神论的|relating to or characterized by belief in or worship of more than one god.|例句: Many ancient civilizations were polytheistic. 许多古代文明信奉多神论。|近义词: pagan, idolatrous|反义词: monotheistic|词性：adj.
pomarium: /pəˈmeəriəm/|果园|an orchard or place where fruit trees are grown.|例句: The old estate had a beautiful pomarium. 这座老庄园有一个美丽的果园。|近义词: orchard, fruit garden|反义词: barren land|词性：n.
pomegranate: /ˈpɒmɪˌɡrænɪt/|石榴|a reddish-orange fruit with many seeds inside.|例句: She ate a pomegranate for a healthy snack. 她吃了一个石榴作为健康的零食。|近义词: granate|反义词: none|词性：n.
pomoy: /ˈpɒmɔɪ/|(非正式)厕所|a toilet (informal).|例句: He went to the pomoy. 他去了厕所。|近义词: toilet, restroom, loo|反义词: none|词性：n.
pompe: /pɒmp/|(旧)壮丽，盛况|magnificence or splendor, especially in a display.|例句: The coronation was done with great pompe. 加冕仪式非常壮丽。|近义词: splendor, magnificence, grandeur|反义词: simplicity, austerity|词性：n.
pompei: /pɒmˈpeɪ/|庞贝（意大利古城）|an ancient Roman city destroyed by the eruption of Mount Vesuvius.|例句: The ruins of Pompeii are a popular tourist destination. 庞贝的遗址是热门的旅游目的地。|近义词: none|反义词: none|词性：n.
pompilus: /ˈpɒmpɪləs/|栉比蜂|a genus of spider wasps.|例句: The entomologist studied the Pompilus. 昆虫学家研究了栉比蜂。|近义词: spider wasp|反义词: none|词性：n.
pompy: /ˈpɒmpi/|(非正式)盛大豪华的|characterized by pomp; ostentatious.|例句: The party was a bit too pompy for my taste. 这个派对对我来说有点过于浮夸了。|近义词: ostentatious, extravagant|反义词: simple, plain|词性：adj.
pon: /pɒn/|（扑克牌中）下注|to stake in a game of cards|例句: He decided to pon a small amount. 他决定下注少量。|近义词: stake, bet|反义词: abstain|词性：v.
pondered: /ˈpɒndəd/|思考，沉思（ponder的过去式和过去分词）|to think about something carefully, especially before making a decision.|例句: She pondered the options before her. 她仔细考虑了她面前的选择。|近义词: contemplate, consider, reflect|反义词: disregard, ignore|词性：v.
pong: /pɒŋ/|恶臭|a strong, unpleasant smell.|例句: There was a pong in the room. 房间里有一股恶臭。|近义词: stink, stench, reek|反义词: fragrance, aroma|词性：n., v.
ponjo: /ˈpɒndʒoʊ/|斗篷，披风|a garment resembling a cloak or mantle, typically made from one piece of cloth with a hole for the head.|例句: He wore a warm poncho to protect against the cold. 他穿了一件温暖的斗篷来御寒。|近义词: cloak, cape, mantle|反义词: none|词性：n.
pony: /ˈpoʊni/|小马|a small horse.|例句: The children were excited to ride the pony. 孩子们很兴奋能骑小马。|近义词: colt, foal|反义词: horse|词性：n.
poof: /puːf/|（表示突然消失或发出小声爆裂）扑的一声，咻|used to indicate a sudden disappearance or a small explosion|例句: The magician made the rabbit disappear with a poof. 魔术师让兔子扑的一声消失了。|近义词: puff, bang|反义词: none|词性：int., n.
pooh: /puː/|呸|used to express contempt or disdain.|例句: Pooh! I don't care what you think. 呸！我不在乎你怎么想。|近义词: pshaw, bah|反义词: none|词性：int.
pool: /puːl/|水池，游泳池|an area of still water; a place for swimming.|例句: They swam in the pool all afternoon. 他们整个下午都在游泳池里游泳。|近义词: pond, swimming pool|反义词: dry land|词性：n.
poon: /puːn/|(俚语)女性生殖器|a vulgar slang word for the female genitalia.|例句: Please avoid using such vulgar language. 请避免使用这种粗俗的语言。|近义词: none (vulgar slang)|反义词: none|词性：n.
poop: /puːp/|(儿童用语)便便，排便|feces; to defecate (informal, esp. for children).|例句: The baby needs to poop. 婴儿需要便便。|近义词: feces, defecate, excrement|反义词: none|词性：n., v.
poor: /pʊər/|贫穷的，可怜的|lacking sufficient money to live at a standard considered comfortable or normal; unfortunate.|例句: They are a poor family. 他们是一个贫穷的家庭。|近义词: impoverished, needy, unfortunate|反义词: rich, wealthy|词性：adj.
poorer: /ˈpʊərə(r)/|更穷的（poor的比较级）|more lacking in resources or less fortunate.|例句: He was poorer than his neighbor. 他比他的邻居更穷。|近义词: more impoverished|反义词: richer, wealthier|词性：adj.
poorly: /ˈpʊərli/|差的，贫乏的，不好地|in a poor way; not well; in an unsatisfactory manner.|例句: She performed poorly on the exam. 她考试考得很差。|近义词: badly, inadequately|反义词: well, adequately|词性：adv.
poox: /puːks/|(俚语)放屁|a vulgar slang term for fart.|例句: He let out a poox. 他放了个屁。|近义词: fart|反义词: none|词性：n.
pop: /pɒp/|（发出爆裂声）砰|a short, sharp, explosive sound; to make such a sound.|例句: The balloon popped loudly. 气球砰的一声爆裂了。|近义词: burst, bang, crack|反义词: none|词性：n., v.
popal: /ˈpɒpl/|流行的，大众的（旧）|of or relating to the people; popular (archaic).|例句: His opinions were quite popal at the time. 他的观点在当时很流行。|近义词: popular, common|反义词: unpopular|词性：adj.
pope: /poʊp/|教皇|the head of the Roman Catholic Church.|例句: The Pope gave a speech to the crowd. 教皇向人群发表了演讲。|近义词: pontiff|反义词: none|词性：n.
popped: /pɒpt/|（发出爆裂声）砰的一声（pop的过去式和过去分词）|made a short, sharp, explosive sound.|例句: The cork popped from the bottle. 瓶塞砰的一声从瓶子里弹了出来。|近义词: burst, detonated|反义词: none|词性：v.
pops: /pɒps/|(非正式)爸爸|father (informal).|例句: Pops is grilling tonight. 爸爸今晚烧烤。|近义词: dad, father|反义词: none|词性：n.
popul: /ˈpɒpjʊl/|人民的（旧）|of or relating to the people (archaic).|例句: His arguments were of popul concern. 他的论点是人民所关心的。|近义词: popular, public|反义词: private|词性：adj.
populace: /ˈpɒpjʊləs/|平民，大众|the people living in a particular country or area.|例句: The populace was angry about the new laws. 平民对新法律感到愤怒。|近义词: public, common people|反义词: elite, aristocracy|词性：n.
popular: /ˈpɒpjələ(r)/|流行的，受欢迎的|liked, admired, or supported by many people.|例句: That song is very popular right now. 那首歌现在很流行。|近义词: well-liked, favored|反义词: unpopular, disliked|词性：adj.
popularity: /ˌpɒpjʊˈlærəti/|受欢迎，流行|the state of being liked, admired, or supported by many people.|例句: His popularity grew with each new song. 他的受欢迎程度随着每首新歌而增长。|近义词: fame, renown|反义词: unpopularity|词性：n.
popularly: /ˈpɒpjʊləli/|普遍地，通俗地|in a way that is generally liked or accepted by many people.|例句: The movie is popularly known as a classic. 这部电影被普遍认为是经典之作。|近义词: commonly, generally|反义词: rarely|词性：adv.
populate: /ˈpɒpjʊleɪt/|居住于，移民于|to live in an area; to cause a place to become inhabited.|例句: The area was populated by settlers. 该地区居住着定居者。|近义词: inhabit, occupy|反义词: vacate, depopulate|词性：v.
populated: /ˈpɒpjʊleɪtɪd/|有人居住的（populate的过去式和过去分词）|having inhabitants; containing people.|例句: The city is densely populated. 这个城市人口稠密。|近义词: inhabited, settled|反义词: uninhabited, deserted|词性：adj.
populates: /ˈpɒpjʊleɪts/|居住于（populate的第三人称单数形式）|lives in a place; causes a place to be inhabited.|例句: She populates the area with her pets. 她和她的宠物一起居住在该地区。|近义词: inhabits, occupies|反义词: vacates, depopulates|词性：v.
populating: /ˈpɒpjʊleɪtɪŋ/|居住于（populate的现在分词）|the action of living in a place; causing a place to be inhabited.|例句: The birds were populating the new birdhouse. 这些鸟正在新的鸟舍里居住。|近义词: inhabiting, occupying|反义词: vacating, depopulating|词性：v.
population: /ˌpɒpjʊˈleɪʃn/|人口|the total number of people inhabiting a country, city, or area.|例句: The world population is growing rapidly. 世界人口正在迅速增长。|近义词: inhabitants, community, people|反义词: emptiness|词性：n.
populations: /ˌpɒpjʊˈleɪʃənz/|人口（复数）|different groups of people inhabiting different places.|例句: These are the populations of the neighboring countries. 这些是邻国的人口。|近义词: inhabitants, communities|反义词: emptiness|词性：n.
populism: /ˈpɒpjʊlɪzəm/|平民主义，民粹主义|a political approach that seeks to appeal to ordinary people who feel that their concerns are disregarded by established elite groups.|例句: Populism is on the rise in many countries. 民粹主义在许多国家兴起。|近义词: demagoguery, plebianism|反义词: elitism|词性：n.
populist: /ˈpɒpjʊlɪst/|平民主义者，民粹主义者|a person who supports populism; relating to populism.|例句: He is a populist politician. 他是一位民粹主义政治家。|近义词: demagogue, demagogic|反义词: elitist|词性：n., adj.
populous: /ˈpɒpjʊləs/|人口稠密的|having a large population; densely populated.|例句: China is a populous country. 中国是一个人口稠密的国家。|近义词: crowded, densely populated|反义词: sparsely populated, unpopulated|词性：adj.
popup: /ˈpɒpʌp/|弹出式窗口|a window that suddenly appears on a computer screen.|例句: The website has too many popups. 这个网站有太多的弹出式窗口。|近义词: notification, modal|反义词: none|词性：n., adj.
porcelain: /ˈpɔːrsəlɪn/|瓷器|a white, translucent ceramic; an object made of this material.|例句: She collects antique porcelain. 她收藏古董瓷器。|近义词: china, ceramics|反义词: none|词性：n., adj.
porche: /pɔːʃ/|（旧）门廊，车道|a covered shelter projecting in front of the entrance to a building (archaic/dialect).|例句: They waited in the porche. 他们在门廊里等候。|近义词: porch, portico|反义词: none|词性：n.
porcupines: /ˈpɔːrkjʊpaɪnz/|豪猪（复数）|mammals with coats of sharp spines or quills.|例句: Porcupines can be found in North America. 北美可以找到豪猪。|近义词: none|反义词: none|词性：n.
pork: /pɔːrk/|猪肉|the flesh of a pig used as food.|例句: He ate pork for dinner. 他晚饭吃了猪肉。|近义词: swine|反义词: none|词性：n.
pornographic: /ˌpɔːnəˈɡræfɪk/|色情的|relating to or depicting sexually explicit material.|例句: The website contains pornographic content. 这个网站包含色情内容。|近义词: explicit, indecent, lewd|反义词: clean, wholesome|词性：adj.
pornography: /pɔːˈnɒɡrəfi/|色情作品，色情|the depiction of sexual activity with the intention of arousing sexual excitement.|例句: Pornography can be harmful to society. 色情作品可能对社会有害。|近义词: erotica, smut|反义词: none|词性：n.
porous: /ˈpɔːrəs/|多孔的，渗水的|having pores or tiny holes that allow liquid or air to pass through.|例句: The sponge is porous. 海绵是多孔的。|近义词: permeable, penetrable|反义词: impermeable, solid|词性：adj.
port: /pɔːrt/|港口|a town or city with a harbor where ships load or unload.|例句: The ship arrived at the port. 船只抵达了港口。|近义词: harbor, dock|反义词: inland|词性：n.
portable: /ˈpɔːrtəbl/|便携式的|able to be easily carried or moved.|例句: He bought a portable radio. 他买了一台便携式收音机。|近义词: movable, transportable|反义词: fixed, stationary|词性：adj.
portal: /ˈpɔːrtl/|入口，门户，门户网站|an entrance or doorway; a website or gateway to many other websites.|例句: This portal provides access to government services. 这个门户网站提供政府服务。|近义词: gateway, entrance, doorway|反义词: exit|词性：n.
portent: /ˈpɔːrtent/|预兆，征兆|a sign or warning that something, usually bad, is likely to happen.|例句: The dark clouds were a portent of a storm. 乌云是暴风雨的预兆。|近义词: omen, sign, foreshadowing|反义词: none|词性：n.
portfolio: /ˌpɔːrtˈfoʊliːoʊ/|投资组合，作品集|a set of investments, or a collection of creative work by an artist or designer.|例句: She has a diverse portfolio of stocks. 她有一个多元化的股票投资组合。|近义词: collection, selection, anthology|反义词: none|词性：n.
porticos: /ˈpɔːrtɪkəʊz/|门廊（portico的复数形式）|a structure consisting of a roof supported by columns, typically attached to a building as a porch.|例句: The building had impressive porticos. 这栋建筑有令人印象深刻的门廊。|近义词: colonnades|反义词: none|词性：n.
portion: /ˈpɔːrʃn/|部分，一份|a part of something; an amount of food served to one person.|例句: He ate a small portion of the pie. 他吃了一小块馅饼。|近义词: part, share, serving|反义词: whole|词性：n.
portions: /ˈpɔːrʃənz/|部分，份（portion的复数形式）|several parts of something; several amounts of food served to one person.|例句: They ate large portions at the restaurant. 他们在餐厅吃了大份的食物。|近义词: parts, shares, servings|反义词: wholes|词性：n.
portrait: /ˈpɔːrtrət/|肖像|a painting, drawing, photograph, or other image of a person or animal.|例句: He painted a portrait of his wife. 他画了一幅他妻子的肖像。|近义词: likeness, depiction, image|反义词: none|词性：n.
portray: /pɔːrˈtreɪ/|描绘，扮演|to depict someone or something in a work of art or literature; to play the role of.|例句: The movie portrays the events accurately. 这部电影准确地描绘了这些事件。|近义词: depict, represent, act|反义词: none|词性：v.
portrayals: /pɔːrˈtreɪəlz/|描绘，扮演（portrayal的复数形式）|instances of depicting or playing a role.|例句: These portrayals were realistic. 这些描绘很真实。|近义词: depictions, representations|反义词: none|词性：n.
portrayed: /pɔːrˈtreɪd/|描绘，扮演（portray的过去式和过去分词）|depicted or played the role of.|例句: He portrayed a complex character. 他扮演了一个复杂的角色。|近义词: depicted, represented, acted|反义词: none|词性：v.
ports: /pɔːrts/|港口（复数）|several towns or cities with harbors where ships load or unload.|例句: Many ships arrive at these ports. 许多船只抵达这些港口。|近义词: harbors, docks|反义词: inland areas|词性：n.
portsmouth: /ˈpɔːtsməθ/|朴茨茅斯（英国城市）|a major port city in southern England.|例句: He grew up in Portsmouth. 他在朴茨茅斯长大。|近义词: none|反义词: none|词性：n.
portugal: /ˈpɔːrtʃʊɡəl/|葡萄牙|a country located on the Iberian Peninsula in southwestern Europe.|例句: They traveled to Portugal for vacation. 他们去葡萄牙度假了。|近义词: none|反义词: none|词性：n.
portugals: /ˈpɔːrtʃʊɡəlz/|葡萄牙的（复数）|of or relating to the country of Portugal|例句: The capitals of Portugals are fascinating. 葡萄牙的首都非常吸引人。|近义词: none|反义词: none|词性：n.
portuguese: /ˌpɔːrtʃʊˈɡiːz/|葡萄牙的，葡萄牙人，葡萄牙语|relating to Portugal, its people, or its language; a person from Portugal; the language of Portugal.|例句: She speaks Portuguese fluently. 她说一口流利的葡萄牙语。|近义词: none|反义词: none|词性：adj., n.
pose: /poʊz/|姿势，摆姿势，造成|a particular way of standing or sitting; to adopt a pose; to present a problem or question.|例句: She struck a graceful pose for the photograph. 她为拍照摆出了一个优雅的姿势。|近义词: position, posture, present|反义词: none|词性：n., v.
poseidon: /pəˈsaɪdən/|波塞冬（希腊神话海神）|the god of the sea in Greek mythology.|例句: The statue of Poseidon was impressive. 波塞冬的雕像令人印象深刻。|近义词: Neptune|反义词: none|词性：n.
poses: /poʊzɪz/|姿势，摆姿势，造成（pose的第三人称单数形式）|adopts a position or presents a question|例句: She poses for a portrait. 她摆姿势拍肖像。|近义词: positions, postures, presents|反义词: none|词性：v.
posessor: /pəˈzesər/|拥有者，占有者|a person who possesses something.|例句: He is the posessor of a vast fortune. 他是一个拥有巨额财富的拥有者。|近义词: owner, holder|反义词: none|词性：n.
posh: /pɒʃ/|时髦的，豪华的|elegant or stylishly luxurious.|例句: They live in a posh neighborhood. 他们住在一个豪华的社区。|近义词: luxurious, elegant, upscale|反义词: poor, simple|词性：adj.
poshest: /ˈpɒʃɪst/|最时髦的，最豪华的（posh的最高级）|the most stylishly luxurious|例句: That is the poshest hotel I've ever seen. 那是我见过的最豪华的酒店。|近义词: most luxurious, most upscale|反义词: simplest, poorest|词性：adj.
posibility: /ˌpɒsəˈbɪlɪti/|可能性（误拼，应为possibility）|a chance that something may happen or be true (misspelling of 'possibility')|例句: There is a posibility of rain. 有下雨的可能性。(应为 There is a possibility of rain) |近义词: chance, likelihood|反义词: impossibility|词性：n.
posing: /ˈpoʊzɪŋ/|摆姿势，造成（pose的现在分词）|adopting a position; presenting a question or problem.|例句: She is posing for a photo. 她正在摆姿势拍照。|近义词: positioning, posturing|反义词: none|词性：v.
posited: /ˈpɒzɪtɪd/|假定，断定（posit的过去式和过去分词）|to put forward as fact or as a basis for argument; to propose.|例句: He posited a new theory. 他提出了一个新的理论。|近义词: proposed, suggested, assumed|反义词: refute, deny|词性：v.
position: /pəˈzɪʃn/|位置，职位，姿态|a place where someone or something is located; a job or rank; a particular stance or posture.|例句: Her position in the company is very important. 她在公司的职位非常重要。|近义词: location, situation, job, stance|反义词: none|词性：n., v.
positional: /pəˈzɪʃənl/|位置的|relating to position.|例句: The positional data is accurate. 位置数据是准确的。|近义词: locational, spatial|反义词: none|词性：adj.
positioned: /pəˈzɪʃənd/|位于，定位（position的过去式和过去分词）|located or placed in a certain position.|例句: The building is positioned on a hill. 这栋建筑位于山顶上。|近义词: located, placed, situated|反义词: none|词性：v.
positioning: /pəˈzɪʃənɪŋ/|定位，调整（position的现在分词）|the act of locating or placing someone or something; the act of adopting a particular stance.|例句: The company is working on its positioning in the market. 这家公司正在努力确定其在市场中的定位。|近义词: locating, placing, situating|反义词: none|词性：v.
positions: /pəˈzɪʃənz/|位置，职位，姿态（position的复数或第三人称单数形式）|several places or locations; several jobs; various stances or postures.|例句: He holds several key positions in the organization. 他在组织中担任几个关键职位。|近义词: locations, places, jobs, stances|反义词: none|词性：n., v.
positionx: /ˈpɒzɪʃənˌeks/|(非正式)位置，坐标（可能是某个特定领域使用的术语）|Position along the X axis.(informal, possibly technical term)|例句: Check the positionX of the object. 检查物体X轴的位置。|近义词: x-axis position|反义词: none|词性：n.
positive: /ˈpɒzətɪv/|积极的，肯定的，正的|optimistic; affirmative; having a good effect; a number greater than zero;|例句: She has a positive attitude. 她有积极的态度。|近义词: optimistic, confident, favorable|反义词: negative, pessimistic|词性：adj.
positively: /ˈpɒzətɪvli/|肯定地，积极地|in an affirmative or positive way; with optimism or good effect.|例句: She reacted positively to the news. 她对这个消息做出了积极的回应。|近义词: certainly, optimistically|反义词: negatively|词性：adv.
positron: /ˈpɒzɪtrɒn/|正电子|a subatomic particle with the same mass as an electron but with a positive charge.|例句: Positrons are the antiparticles of electrons. 正电子是电子的反粒子。|近义词: antielectron|反义词: electron|词性：n.
possess: /pəˈzes/|拥有，具有|to have or own something; to have a quality or characteristic.|例句: He possesses a lot of talent. 他很有天赋。|近义词: own, have, hold|反义词: lack, need|词性：v.
possessed: /pəˈzest/|拥有的，着迷的（possess的过去式和过去分词）|owned; controlled or dominated by a demon or spirit; exhibiting great enthusiasm.|例句: She was possessed by a desire to succeed. 她被成功的欲望所驱使。|近义词: owned, controlled, obsessed|反义词: lacked, free|词性：v., adj.
possessing: /pəˈzesɪŋ/|拥有的，具有（possess的现在分词）|having or owning something; having a quality or characteristic.|例句: He is possessing a valuable collection. 他拥有一份有价值的收藏。|近义词: owning, having, holding|反义词: lacking|词性：v.
possession: /pəˈzeʃn/|拥有，财产|the state of owning or controlling something; something that is owned.|例句: They have taken possession of the house. 他们已经占有了这栋房子。|近义词: ownership, property, control|反义词: lack, loss|词性：n.
possessions: /pəˈzeʃənz/|财产（复数）|things owned by someone.|例句: They packed their possessions. 他们收拾了他们的财产。|近义词: belongings, property, assets|反义词: debts|词性：n.
possibilities: /ˌpɒsəˈbɪlətɪz/|可能性（复数）|several chances that something may happen or be true.|例句: They discussed the possibilities. 他们讨论了各种可能性。|近义词: chances, likelinesses, prospects|反义词: impossibilities|词性：n.
possibility: /ˌpɒsəˈbɪləti/|可能性|a chance that something may happen or be true.|例句: There is a possibility that it will rain. 有可能会下雨。|近义词: chance, likelihood, prospect|反义词: impossibility|词性：n.
possible: /ˈpɒsəbl/|可能的|able to be done or happen.|例句: It is possible to finish the project by Friday. 在星期五之前完成这个项目是有可能的。|近义词: feasible, attainable, viable|反义词: impossible|词性：adj.
possibly: /ˈpɒsəbli/|可能地，或许|in a way that is possible; perhaps.|例句: It might possibly rain later. 之后可能会下雨。|近义词: perhaps, maybe, potentially|反义词: certainly, definitely|词性：adv.
post: /poʊst/|邮寄，帖子，职位，柱子|to send something by mail; a piece of writing published online; a job or position; a pole or stake set upright.|例句: I need to post this letter. 我需要邮寄这封信。|近义词: send, mail, position, pillar|反义词: receive|词性：n., v.
postclassical: /ˌpoʊstˈklæsɪkl/|后古典的|relating to or denoting the period following the classical period.|例句: Postclassical art is very different. 后古典艺术非常不同。|近义词: after classical|反义词: classical, preclassical|词性：adj.
postcolonial: /ˌpoʊstkəˈloʊniəl/|后殖民的|relating to the period following the end of colonial rule.|例句: Postcolonial literature often deals with issues of identity. 后殖民文学经常探讨身份认同的问题。|近义词: after colonial|反义词: colonial, precolonial|词性：adj.
posted: /poʊstɪd/|邮寄，张贴，发布（post的过去式和过去分词）|sent by mail; published online; stationed or assigned to a job.|例句: He posted the letter yesterday. 他昨天邮寄了这封信。|近义词: mailed, published, assigned|反义词: none|词性：v.
poster: /ˈpoʊstər/|海报|a large printed picture or notice displayed publicly.|例句: She put a poster on her wall. 她在墙上贴了一张海报。|近义词: placard, billboard|反义词: none|词性：n.
