ruling: /ˈruːlɪŋ/|统治，裁决；|a decision made by a judge or authority；|The court issued a ruling against the company. 法院对该公司做出了不利的裁决。|近义词：decision, verdict, decree|反义词：nullification, rescission, |词性：n., adj.
rumble: /ˈrʌmbl/|隆隆声；发出隆隆声|a low, heavy, continuous sound; to make such a sound|The distant thunder rumbled through the valley. 远处雷声在山谷中隆隆作响。|近义词：boom, roar, grumble|反义词：quiet, silence, |词性：n., v.
rummel: /ˈrʌməl/|喧闹，混乱；|a noisy or confused situation or state；|The kids made a rummel while playing in the backyard. 孩子们在后院玩耍时弄得乱糟糟的。|近义词：disorder, chaos, commotion|反义词：order, calm, peace|词性：n.
rumor: /ˈruːmər/|谣言；传言|a story or statement in circulation without confirmation; to spread by rumor|There's a rumor going around that the company is going to be sold. 有传言说这家公司要被出售。|近义词：gossip, hearsay, report|反义词：fact, truth, certainty|词性：n., v.
rumored: /ˈruːmərd/|传闻的；|said to be true, but not confirmed; having a rumor associated with it|The rumored celebrity appearance drew a large crowd. 传闻中的名人现身吸引了很多人。|近义词：alleged, supposed, reputed|反义词：confirmed, verified, proven|词性：adj.
rumors: /ˈruːmərz/|谣言（复数）|plural of rumor; unverified information that is circulating|Ignore the rumors, and wait for official information. 忽略那些谣言，等待官方消息。|近义词：gossips, hearsay, reports|反义词：facts, truths, certainties|词性：n.
run: /rʌn/|跑；奔跑|to move at a speed faster than a walk; act of running|She runs five miles every morning. 她每天早上跑五英里。|近义词：dash, sprint, jog|反义词：walk, stroll, stand|词性：v., n.
runaway: /ˈrʌnəˌweɪ/|逃跑者；失控的|a person who has run away from home; out of control|The runaway train went off the tracks. 那辆失控的火车脱轨了。|近义词：fugitive, escaper, uncontrolled|反义词：obedient, compliant, controllable|词性：n., adj.
runaways: /ˈrʌnəˌweɪz/|逃跑者（复数）|plural of runaway; people who have run away from home|There are shelters for runaways in the city. 这个城市有为离家出走者提供的庇护所。|近义词：fugitives, escapers|反义词：settlers, homebodies|词性：n.
rundown: /ˈrʌnˌdaʊn/|概要；衰败的|a summary or review; in a bad condition|The old house was in a rundown state. 这栋老房子破旧不堪。|近义词：summary, overview, dilapidated|反义词：detailed, elaborate, pristine|词性：n., adj.
runet: /ˈruːˌnet/|俄语互联网；|the Russian-language segment of the internet;|The Runet is a popular social media platform. 俄语互联网是一个流行的社交媒体平台。|近义词：None|反义词：None|词性：n.
rung: /rʌŋ/|梯级，（工具的）横档；|a horizontal support in a ladder; a position in a hierarchy|He climbed the ladder one rung at a time. 他一次爬一个梯级地爬上了梯子。|近义词：step, stage, level|反义词：None|词性：n.
runnable: /ˈrʌnəbl/|可运行的；|able to be run or executed, especially of a computer program; suitable for running on a certain system|The new software is runnable on most computers. 这个新软件可以在大多数电脑上运行。|近义词：executable, usable, viable|反义词：inoperable, unusable, broken|词性：adj.
runner: /ˈrʌnər/|跑步者；赛跑选手|a person who runs; a competitor in a race|The runner finished the marathon in record time. 这名赛跑运动员以破纪录的时间完成了马拉松比赛。|近义词：sprinter, jogger, racer|反义词：walker, straggler|词性：n.
running: /ˈrʌnɪŋ/|跑步；运行中的|the activity or action of running; in progress or operation|Running is her favorite form of exercise. 跑步是她最喜欢的运动方式。|近义词：operating, working, ongoing|反义词：stationary, stopped, idle|词性：n., adj.
runs: /rʌnz/|跑(第三人称单数)|third person singular present of run|He runs very fast. 他跑得非常快。|近义词：sprints, dashes|反义词：walks, strolls|词性：v.
runspeed: /ˈrʌnˌspiːd/|跑步速度；|the speed at which someone or something runs;|His run speed is amazing. 他的跑步速度惊人。|近义词：pace, velocity|反义词：None|词性：n.
runtime: /ˈrʌnˌtaɪm/|运行时间；|the time during which a program is running;|The runtime of the program was much longer than expected. 该程序的运行时间比预期长得多。|近义词：execution time, processing time|反义词：compile time, setup time|词性：n.
runway: /ˈrʌnˌweɪ/|跑道|a strip of hard ground on which airplanes take off and land|The plane landed safely on the runway. 飞机在跑道上安全着陆。|近义词：airstrip, tarmac|反义词：None|词性：n.
ruo: /ruːoʊ/|若（古代用法）|an archaic term for 'if', used in classical writings|Ruo you are not convinced, you may try. 若你不信，你可以试试。|近义词：if|反义词：None|词性：conj.
rupe: /ruːp/|卢比（印度货币单位）|Indian and Nepalese currency unit, similar to dollar|A hundred rupees won't buy much these days. 一百卢比现在买不了什么东西。|近义词：None|反义词：None|词性：n.
rural: /ˈrʊrəl/|乡村的；|in, relating to, or characteristic of the countryside rather than the town;|They live in a rural area far from the city. 他们住在远离城市的乡村地区。|近义词：rustic, country, pastoral|反义词：urban, metropolitan, city|词性：adj.
rurus: /ˈruːrʊs/|红色的（古代用法）|an old term for red or reddish color; used in Latin or scientific contexts|The rurus hue of the sunset was stunning. 日落时分红色的光芒令人惊叹。|近义词：red, reddish|反义词：None|词性：adj.
rus: /rʌs/|罗斯（古代斯拉夫民族名称）|an ancient Slavic people who were the predecessors of modern-day Russians|The Rus settled in the area that is now Ukraine and Russia. 罗斯人定居在现在乌克兰和俄罗斯的地区。|近义词：None|反义词：None|词性：n.
ruse: /ruːz/|诡计；花招|a trick or act that is used to deceive someone|He used a ruse to get her attention. 他用了一个诡计来吸引她的注意力。|近义词：trick, stratagem, ploy|反义词：honesty, frankness, candor|词性：n.
rush: /rʌʃ/|冲；匆忙|to move with great speed; a sudden quick movement|He had to rush to catch the bus. 他不得不赶紧去赶公交车。|近义词：dash, hurry, sprint|反义词：saunter, dawdle, linger|词性：v., n.
rushed: /rʌʃt/|匆忙的；仓促的|done or acting with great haste or urgency; moved with great speed|She rushed through her work so she could go home. 她匆匆忙忙地做完工作，以便回家。|近义词：hasty, hurried, quick|反义词：leisurely, slow, deliberate|词性：adj., v.
russ: /rʌs/|俄罗斯人（缩写）|a shortened form of Russian; a person from Russia|Russ is from Moscow. 俄罗斯人来自莫斯科。|近义词：Russian|反义词：None|词性：n., adj.
russell: /ˈrʌsl/|罗素（人名）|a surname, popular as a given name in some English-speaking countries|Russell is a common surname. 罗素是一个常见的姓氏。|近义词：None|反义词：None|词性：n.
russia: /ˈrʌʃə/|俄罗斯|a country in Eastern Europe and Northern Asia|Russia is the largest country in the world. 俄罗斯是世界上最大的国家。|近义词：None|反义词：None|词性：n.
russian: /ˈrʌʃən/|俄罗斯的；俄罗斯人；俄语|relating to Russia, its people, or its language|She speaks fluent Russian. 她说一口流利的俄语。|近义词：None|反义词：None|词性：adj., n.
russians: /ˈrʌʃənz/|俄罗斯人（复数）|plural of Russian; people from Russia|Many Russians live in Moscow. 很多俄罗斯人住在莫斯科。|近义词：None|反义词：None|词性：n.
russo: /ˈrʌsoʊ/|俄国的；俄罗斯的（复合词）|a combining form meaning "Russian," often in compound words|The Russo-Japanese War was a conflict between Russia and Japan. 日俄战争是俄罗斯和日本之间的一场冲突。|近义词：Russian|反义词：None|词性：adj.
russophile: /ˈrʌsəˌfaɪl/|亲俄的人|a person who admires Russia, its people, and its culture|He is a self-proclaimed Russophile. 他自称是亲俄人士。|近义词：pro-Russian|反义词：anti-Russian|词性：n.
rust: /rʌst/|铁锈；生锈|a reddish-brown coating formed on iron or steel by oxidation; to become oxidized|The old car was covered in rust. 这辆旧车生满了铁锈。|近义词：corrosion, oxidation|反义词：None|词性：n., v.
rustin: /ˈrʌstɪn/|拉斯廷（人名）|a surname and given name, often of American or African descent|Bayard Rustin was a civil rights leader. 巴亚德·拉斯廷是一位民权领袖。|近义词：None|反义词：None|词性：n.
rusty: /ˈrʌsti/|生锈的；|covered with or affected by rust; out of practice|The old tools were rusty and unusable. 这些旧工具生锈了，无法使用。|近义词：corroded, oxidized, impaired|反义词：new, shiny, polished|词性：adj.
ruth: /ruːθ/|露丝（人名）|a female given name of Hebrew origin; a biblical character|Ruth is a beautiful name. 露丝是一个好听的名字。|近义词：None|反义词：None|词性：n.
rutherford: /ˈrʌðərˌfɔːrd/|卢瑟福（人名）|a surname and given name, associated with the famous physicist Ernest Rutherford|Ernest Rutherford made many contributions to physics. 欧内斯特·卢瑟福对物理学做出了许多贡献。|近义词：None|反义词：None|词性：n.
ruthless: /ˈruːθlɪs/|无情的；残忍的|having no pity or compassion; cruel; merciless|The ruthless dictator oppressed his people. 这位冷酷的独裁者压迫他的人民。|近义词：merciless, cruel, heartless|反义词：compassionate, merciful, kind|词性：adj.
ruthlessly: /ˈruːθlɪsli/|无情地；残忍地|in a ruthless manner; without compassion or pity|The company ruthlessly pursued its goals. 这家公司无情地追求其目标。|近义词：mercilessly, cruelly, heartlessly|反义词：compassionately, mercifully, kindly|词性：adv.
ruthlessness: /ˈruːθlɪsnɪs/|无情；残忍|the quality of being ruthless; lack of pity or compassion|The ruthlessness of the attack shocked everyone. 这次袭击的残忍让每个人都感到震惊。|近义词：cruelty, heartlessness, pitilessness|反义词：compassion, mercy, kindness|词性：n.
rve: /ˌɑːrˌviː/|房车（缩写）|abbreviation for recreational vehicle; a vehicle equipped for living in|They traveled across the country in their RVE. 他们开着房车横穿了这个国家。|近义词：recreational vehicle, camper|反义词：None|词性：n.
rvi: /ˌɑːrˌviːˈaɪ/|放射性碘摄取率|abbreviation for radioiodine uptake|An RVI test is used to assess thyroid function. 放射性碘摄取率测试用于评估甲状腺功能。|近义词：radioactive iodine uptake|反义词：None|词性：n.
rw: /ˈɑːrˈdʌbljuː/|卢旺达（ISO国家代码）|ISO country code for Rwanda; used in internet addresses and databases|The RW domain is assigned to Rwanda. RW域分配给卢旺达。|近义词：None|反义词：None|词性：n.
rwanda: /ruːˈɑːndə/|卢旺达|a country in East Africa|Rwanda is known for its beautiful landscapes. 卢旺达以其美丽的风景而闻名。|近义词：None|反义词：None|词性：n.
ry: /raɪ/|赖（姓氏或人名）|a surname; also used as a given name; often a shortening of Ryan|Ry is a good friend. 赖是一位好朋友。|近义词：None|反义词：None|词性：n.
ryan: /ˈraɪən/|瑞安（人名）|a popular male given name of Irish origin|Ryan is a common given name. 瑞安是一个常见的名字。|近义词：None|反义词：None|词性：n.
ryuku: /ˈrjuːkuː/|琉球（群岛）|a chain of islands in the western Pacific Ocean, belonging to Japan|The Ryuku islands are known for their unique culture. 琉球群岛以其独特的文化而闻名。|近义词：None|反义词：None|词性：n.
sa: /ˈɛsˌeɪ/|南非（ISO国家代码）|ISO country code for South Africa; used in internet addresses and databases|The SA domain is assigned to South Africa. SA域分配给南非。|近义词：None|反义词：None|词性：n.
saale: /ˈzaːlə/|萨勒河（河流名）|a river in central Germany, tributary to the Elbe|The Saale river flows through many German towns. 萨勒河流经许多德国城镇。|近义词：None|反义词：None|词性：n.
saaron: /ˈsɛərɑːn/|萨aron（人名）|A variation of Sarah, sometimes used as a last name.|Saaron is a talented musician. 萨aron是一位有才华的音乐家。|近义词：None|反义词：None|词性：n.
saber: /ˈseɪbər/|军刀|a type of sword with a curved blade|He carried a saber into battle. 他拿着一把军刀投入战斗。|近义词：sword, cutlass, scimitar|反义词：None|词性：n.
sabine: /ˈsæbɪn/|萨宾（人名，地名）|A female name of Latin origin and name of an ancient people.|Sabine is from ancient Rome. 萨宾来自古罗马。|近义词：None|反义词：None|词性：n.
sabines: /ˈsæbɪnz/|萨宾人（复数）|an ancient Italic people that lived in the central Apennines|The Sabines played an important role in early Roman history. 萨宾人在早期罗马历史中扮演了重要角色。|近义词：None|反义词：None|词性：n.
sabotage: /ˈsæbəˌtɑːʒ/|破坏；阴谋破坏|deliberately destroying or damaging something; act of such damage|The factory was shut down due to sabotage. 由于破坏，工厂关闭了。|近义词：vandalism, subversion, wrecking|反义词：maintenance, repair, preservation|词性：n., v.
saboteurs: /ˈsæbəˈtɜːrz/|破坏者；阴谋破坏者|people who commit acts of sabotage|The saboteurs were caught and arrested. 破坏者被抓获并逮捕了。|近义词：vandals, wreckers|反义词：protectors, preservers|词性：n.
sabu: /ˈsɑːbuː/|萨布（人名）|an Indian film actor popular in the 1930s-1950s|Sabu was known for his exotic roles in movies. 萨布以其在电影中的异国情调角色而闻名。|近义词：None|反义词：None|词性：n.
sac: /sæk/|囊|a baglike structure in an organism|The air sac is important for breathing. 气囊对呼吸很重要。|近义词：pouch, bag|反义词：None|词性：n.
sachin: /ˈsɑːtʃɪn/|萨钦（人名）|an Indian male given name|Sachin is a popular name in India. 萨钦在印度是一个流行的名字。|近义词：None|反义词：None|词性：n.
sack: /sæk/|麻袋；解雇|a large bag made of strong material; to dismiss from a job|He put the potatoes in a sack. 他把土豆放进麻袋里。|近义词：bag, pouch, dismiss|反义词：hire, employ, keep|词性：n., v.
sacked: /sækt/|被解雇的；装袋的|past tense and past participle of sack; dismissed from a job or put into a sack|He was sacked from his job for stealing. 他因盗窃而被解雇。|近义词：fired, dismissed, bagged|反义词：hired, employed, retained|词性：v., adj.
sackers: /ˈsækərz/|解雇人的人|people who dismiss others from a job; those who put something into a sack|The sackers did their job without compassion. 解雇者们冷酷地完成了工作。|近义词：firers, dismissers|反义词：employers, hirers|词性：n.
sacking: /ˈsækɪŋ/|解雇；装袋|the action of dismissing someone from a job; material used to make sacks|The sacking of several workers caused unrest. 多名工人被解雇引起了动荡。|近义词：dismissal, firing, bagging|反义词：hiring, employment|词性：n.
sackville: /ˈsækvɪl/|萨克维尔（地名，人名）|a surname or place name; a town in New Brunswick, Canada|Sackville is a small town in Canada. 萨克维尔是加拿大的一座小镇。|近义词：None|反义词：None|词性：n.
sacred: /ˈseɪkrɪd/|神圣的；庄严的|connected with God or a god; deserving great respect; holy|The temple is a sacred place. 这座寺庙是一个神圣的地方。|近义词：holy, divine, consecrated|反义词：secular, profane, unholy|词性：adj.
sacrifice: /ˈsækrɪˌfaɪs/|牺牲；献祭|giving up something valued for a particular purpose; offering to a deity|She made a sacrifice to help her family. 她做出了牺牲来帮助她的家人。|近义词：offering, relinquishment, devotion|反义词：selfishness, indulgence, benefit|词性：n., v.
sacrificed: /ˈsækrɪˌfaɪst/|牺牲的；献祭的|past tense and past participle of sacrifice; having given up something valued; offered to a deity|He sacrificed his career for his family. 他为了家庭牺牲了自己的事业。|近义词：relinquished, offered, devoted|反义词：kept, retained, benefited|词性：v., adj.
sacrifices: /ˈsækrɪˌfaɪsɪz/|牺牲（复数）；献祭（复数）|plural of sacrifice; acts of giving up something valued; offerings to a deity|She made many sacrifices for her children. 她为她的孩子们做了很多牺牲。|近义词：offerings, relinquishments, devotions|反义词：selfishness, indulgences|词性：n.
sacrificial: /ˌsækrɪˈfɪʃəl/|牺牲的；献祭的|relating to sacrifice or offering to a deity|The sacrificial lamb was led to the altar. 献祭的羔羊被带到祭坛前。|近义词：offering, devoted|反义词：non-sacrificial|词性：adj.
sacrificing: /ˈsækrɪˌfaɪsɪŋ/|牺牲的；献祭的|present participle of sacrifice; giving up something valued; offering to a deity|She was sacrificing her time to help her friend. 她在牺牲自己的时间来帮助她的朋友。|近义词：relinquishing, offering, devoting|反义词：keeping, retaining|词性：v.
sacrificio: /ˌsakriˈfiʃioʊ/|牺牲（意大利语）|Italian word for sacrifice|Il sacrificio è stato molto doloroso. 牺牲是非常痛苦的。|近义词：sacrifice|反义词：None|词性：n.
sacrosanct: /ˈsækrəˌsæŋkt/|神圣不可侵犯的|regarded as too important or valuable to be interfered with; inviolable|The law was considered sacrosanct. 这项法律被认为是神圣不可侵犯的。|近义词：inviolable, untouchable, sacred|反义词：violable, profane, ordinary|词性：adj.
sad: /sæd/|悲伤的；伤心的|feeling or showing sorrow; unhappy|She felt sad when she heard the news. 当她听到这个消息时，她感到很悲伤。|近义词：unhappy, sorrowful, dejected|反义词：happy, joyful, cheerful|词性：adj.
sadic: /ˈseɪdɪk/|施虐的|deriving pleasure from inflicting pain on others|He was known for his sadic behavior. 他以施虐行为而闻名。|近义词：cruel, brutal, sadistic|反义词：kind, gentle, compassionate|词性：adj.
sadistic: /səˈdɪstɪk/|施虐的；残忍的|deriving pleasure from inflicting pain, suffering, or humiliation on others|His sadistic actions caused a lot of pain. 他的虐待行为造成了很多痛苦。|近义词：cruel, brutal, inhumane|反义词：kind, gentle, compassionate|词性：adj.
sadly: /ˈsædli/|悲伤地；不幸地|in a sad manner; unfortunately|Sadly, he had to leave. 可悲的是，他不得不离开。|近义词：unhappily, regrettably, mournfully|反义词：happily, cheerfully, joyfully|词性：adv.
sadness: /ˈsædnəs/|悲伤；伤心|the state of being sad; sorrow|She couldn't hide her sadness. 她无法隐藏她的悲伤。|近义词：sorrow, unhappiness, grief|反义词：happiness, joy, cheerfulness|词性：n.
saer: /sɛər/|萨尔（人名，姓氏）|a surname often of Welsh or Irish origin|Saer is a somewhat unusual name. 萨尔是一个有点不寻常的名字。|近义词：None|反义词：None|词性：n.
safe: /seɪf/|安全的；保险的|protected from danger or harm; not likely to cause harm|The children are safe at home. 孩子们在家很安全。|近义词：secure, protected, harmless|反义词：dangerous, hazardous, unsafe|词性：adj.
safeguard: /ˈseɪfˌɡɑːrd/|保护；保护措施|a measure taken to protect something or someone; to protect against something|The company has safeguards in place to prevent accidents. 公司采取了保护措施来防止事故。|近义词：protection, defense, guard|反义词：hazard, danger, threat|词性：n., v.
safeguarded: /ˈseɪfˌɡɑːrdɪd/|保护的|past tense and past participle of safeguard; protected against something|The data was carefully safeguarded. 这些数据被小心地保护着。|近义词：protected, secured, guarded|反义词：endangered, threatened, compromised|词性：v., adj.
safely: /ˈseɪfli/|安全地|in a safe manner; without danger or harm|The plane landed safely. 飞机安全着陆了。|近义词：securely, harmlessly, carefully|反义词：dangerously, unsafely, hazardously|词性：adv.
safer: /ˈseɪfər/|更安全的|comparative form of safe; less likely to cause danger or harm|The new car is safer than the old one. 这辆新车比旧车更安全。|近义词：more secure, more protected, less hazardous|反义词：more dangerous, riskier, less secure|词性：adj.
safety: /ˈseɪfti/|安全；安全措施|the state of being safe; freedom from harm or danger|Safety is their primary concern. 安全是他们首要考虑的问题。|近义词：security, protection, well-being|反义词：danger, risk, hazard|词性：n.
safetyasu: /ˈseɪfti ˌɑːˌɛsˌjuː/|安全（缩写）|abbreviation of safety as you (like in safety as you go)|Safetyasu is our top priority. 安全是我们首要考虑的事情。|近义词：safety|反义词：None|词性：n.
sagas: /ˈsɑːɡəz/|传奇（复数）|plural of saga; long stories about heroic achievements or events|The Icelandic sagas tell about Viking heroes. 冰岛传奇讲述了维京英雄的故事。|近义词：tales, epics, legends|反义词：None|词性：n.
sage: /seɪdʒ/|智者；贤明的|a wise person; having or showing great wisdom|The sage offered valuable advice. 智者提供了宝贵的建议。|近义词：wise, prudent, judicious|反义词：foolish, unwise, imprudent|词性：n., adj.
sahara: /səˈhɑːrə/|撒哈拉沙漠|the largest hot desert in the world, located in North Africa|The Sahara Desert covers a large part of Africa. 撒哈拉沙漠覆盖了非洲的很大一部分。|近义词：None|反义词：None|词性：n.
said: /sɛd/|说（过去式和过去分词）|past tense and past participle of say; spoke words|He said he was tired. 他说他累了。|近义词：stated, declared, expressed|反义词：None|词性：v.
sail: /seɪl/|帆；航行|a piece of fabric that uses wind to propel a boat; to travel by water|The ship set sail for distant shores. 这艘船扬帆驶向远方。|近义词：navigate, voyage, cruise|反义词：dock, anchor|词性：n., v.
sailed: /seɪld/|航行了（过去式和过去分词）|past tense and past participle of sail; traveled by water using sails|They sailed across the Atlantic. 他们乘船横渡了大西洋。|近义词：navigated, voyaged, cruised|反义词：docked, anchored|词性：v.
sailing: /ˈseɪlɪŋ/|航行；帆船运动|the activity or sport of traveling on water in a boat or ship|Sailing is a popular activity in the summer. 帆船运动在夏季很受欢迎。|近义词：navigation, voyaging, cruising|反义词：docking, anchoring|词性：n.
sailors: /ˈseɪlərz/|水手；海员|people who work on ships; those who navigate ships|The sailors worked hard to keep the ship running. 水手们努力工作以维持船的运转。|近义词：mariners, seafarers, seamen|反义词：landlubbers|词性：n.
saint: /seɪnt/|圣人|a person of great holiness or virtue; recognized by a church|Saint Francis was known for his charity. 圣弗朗西斯以他的慈善事业而闻名。|近义词：holy person, divine being|反义词：sinner, evildoer|词性：n.
saipan: /ˈsaɪˌpæn/|塞班岛|the largest of the Northern Mariana Islands, a US territory|Saipan is a popular tourist destination. 塞班岛是一个受欢迎的旅游目的地。|近义词：None|反义词：None|词性：n.
saka: /ˈsɑːkə/|萨卡（人名）|Indian and Japanese name with multiple meanings.|Saka was a great warrior. 萨卡是一位伟大的战士。|近义词：None|反义词：None|词性：n.
sakara: /ˈsɑːkərə/|萨卡拉（埃及地名）|an ancient burial ground in Egypt|Sakara is known for its pyramids and tombs. 萨卡拉以其金字塔和陵墓而闻名。|近义词：None|反义词：None|词性：n.
sake: /seɪk/|缘故；目的|for the purpose of; in order to achieve; benefit or advantage|He did it for his family's sake. 他是为了他的家人的缘故才做的。|近义词：purpose, reason, motive|反义词：None|词性：n.
salad: /ˈsæləd/|沙拉|a dish of raw vegetables, often with a dressing|She had a salad for lunch. 她午餐吃了一份沙拉。|近义词：greens, slaw, mixed vegetables|反义词：None|词性：n.
