synthesis: /ˈsɪnθəsɪs/|合成，综合|the combination of ideas to form a theory or system.|The synthesis of these two compounds produces a new material.|combination, fusion|analysis, separation|n.
synthetic: /sɪnˈθɛtɪk/|合成的，人造的|made by chemical synthesis, especially to imitate a natural product.|This jacket is made of synthetic material.|artificial, man-made|natural, organic|adj.
synthetically: /sɪnˈθɛtɪkli/|合成地，人造地|in a way that is made by chemical synthesis.|This chemical was produced synthetically.|artificially, artificially|naturally|adv.
syphilis: /ˈsɪfəlɪs/|梅毒|a chronic bacterial disease that is contracted chiefly by infection during sexual intercourse.|He was diagnosed with syphilis.|venereal disease|healthy|n.
syracuse: /ˈsɪrəˌkjuːs/|锡拉丘兹（美国城市名）|a city in central New York State.|We drove through Syracuse on our way to Canada.|place name||n.
syria: /ˈsɪriə/|叙利亚|a country in the Middle East.|The war in Syria has caused a large refugee crisis.|country name||n.
syrian: /ˈsɪriən/|叙利亚的，叙利亚人|relating to Syria, or its people.|The Syrian government has been fighting a civil war for years.|Syrian|non-Syrian|adj., n.
system: /ˈsɪstəm/|系统，制度|a set of things working together as parts of a mechanism or an interconnecting network; a complex whole.|The country's political system is flawed.|structure, network|disorder, chaos|n.
systematic: /ˌsɪstəˈmætɪk/|系统的，有计划的|done or acting according to a fixed plan or system; methodical.|The police carried out a systematic search of the building.|methodical, organized|unsystematic, disorganized|adj.
systematically: /ˌsɪstəˈmætɪkli/|有系统地，有计划地|in a systematic manner.|The data was collected systematically.|methodically, orderly|randomly, haphazardly|adv.
systemic: /sɪˈstɛmɪk/|全身的，系统的|relating to a system, especially as opposed to a particular part.|The disease had a systemic effect on the body.|general, widespread|local, confined|adj.
systems: /ˈsɪstəmz/|系统（复数）|more than one system.|The company uses multiple computer systems.|structures, networks|disorders, chaos|n.
ta: /tɑː/|（表示感谢或同意的感叹词）|thank you (used informally).|Ta, that’s very kind of you.|thanks|no thanks|interj.
taau: |tau蛋白（Tau protein）|a protein that stabilizes microtubules, mostly found in neurons|Tau protein is involved in the development of neurodegenerative diseases.|protein||n.
tab: /tæb/|标签，制表符|a small piece of material attached to or projecting from something, used to hold, fasten, or identify it.|He pulled the tab to open the can.|label, tag|whole, body|n.
tabasco: /təˈbæskoʊ/|塔巴斯科辣酱|a brand of very hot pepper sauce.|I like to add Tabasco sauce to my eggs.|hot sauce|mild sauce|n.
tabbing: /ˈtæbɪŋ/|制表，加标签|the action of adding a tab to something.|Tabbing the files is a great way to keep them organized.|labeling, marking|unmarking, deleting labels|n.
table: /ˈteɪbl̩/|桌子，表格|a piece of furniture with a flat top and legs|The family sat around the table for dinner.|furniture, chart|n.
tables: /ˈteɪblz/|桌子（复数），表格（复数）|more than one table or chart.|The restaurant has many tables.|furnitures, charts|n.
tablespoon: /ˈteɪbl̩ˌspuːn/|汤匙|a large spoon used for serving food or as a measurement in cooking.|Add one tablespoon of sugar to the mixture.|serving spoon|teaspoon|n.
tablespoons: /ˈteɪbl̩ˌspuːnz/|汤匙（复数）|more than one tablespoon.|Add two tablespoons of olive oil.|serving spoons||n.
tablet: /ˈtæblɪt/|药片，平板电脑|a small, solid dose of medicine; a thin, flat device with a touch screen.|She took a tablet for her headache; I use my tablet for reading.|pill, device|n.
tabletop: /ˈteɪblˌtɒp/|桌面|the flat top surface of a table.|I wiped the tabletop clean.|surface, top|n.
tablets: /ˈtæblɪts/|药片（复数），平板电脑（复数）|more than one pill or a thin, flat device with a touch screen.|Take two tablets a day, there are several tablets available on the market.|pills, devices|n.
tabs: /tæbz/|标签（复数），制表符（复数）|more than one tab.|The folder has many tabs; Use tab to jump between fields.|labels, tags|n.
tacitus: /ˈtæsɪtəs/|塔西佗（人名）|a Roman historian.|Tacitus' works provide valuable insights into Roman history.|historian||n.
tackle: /ˈtækəl/|处理，抢断|make determined efforts to deal with a problem or difficult task; an act of attempting to stop or bring down an opponent.|The government is trying to tackle the problem of unemployment; He made a tackle to stop the runner.|address, confront, interception|evade, avoid|v., n.
tackles: /ˈtækəlz/|处理（复数），抢断（复数）|more than one tackle or efforts.|The team made several tackles during the game; The government faces many problems that it needs to tackle.|interceptions, efforts|v., n.
tacks: /tæks/|图钉（复数），方针（复数）|small, sharp objects used to hold paper to something; a course of action adopted or pursued; |The bulletin board is full of tacks, he changed his tack.|pins, approaches|n.
tactic: /ˈtæktɪk/|战术，策略|an action or strategy carefully planned to achieve a specific end.|The general devised a clever tactic to win the battle.|strategy, plan|blunder, mistake|n.
tactical: /ˈtæktɪkəl/|战术的，策略的|relating to or constituting actions carefully planned to achieve a specific end.|The army had a tactical advantage; His comments were tactical, designed to win support.|strategic, calculated|unplanned, spontaneous|adj.
tactically: /ˈtæktɪkli/|战术上，策略上|in a tactical way.|The army maneuvered tactically; he spoke tactically.|strategically, carefully|randomly, haphazardly|adv.
tactics: /ˈtæktɪks/|战术（复数），策略（复数）|more than one tactic.|The team's tactics were effective; His comments were purely tactics.|strategies, plans|n.
tactile: /ˈtæktaɪl/|触觉的，有触觉的|connected with the sense of touch.|The fabric has a tactile texture.|touchable, palpable|untouchable|adj.
tadpole: /ˈtædpoʊl/|蝌蚪|the larva of a frog or toad.|The pond was full of tadpoles.|larva|adult|n.
tadpoles: /ˈtædpoʊlz/|蝌蚪（复数）|more than one tadpole.|The children caught tadpoles in the stream.|larvae||n.
tag: /tæɡ/|标签，贴标签|a label attached to someone or something for identification; attach a label to.|He put a tag on the suitcase; they tagged the animals before releasing them.|label, mark|detach, unmark|n., v.
tagged: /tæɡd/|贴标签的|past tense of tag.|The luggage was tagged,; the animals were tagged.|labeled|unlabeled|v.
tagline: /ˈtæɡlaɪn/|标语，广告语|a short text serving to clarify or advertise something; a slogan.|"Just do it" is a famous tagline; The tagline of the movie was mysterious.|slogan, motto|n.
tagma: /ˈtæɡmə/|节片（生物学）|a section of the body of a metameric animal|The tagma consists of head, thorax, and abdomen.|body segment||n.
tags: /tæɡz/|标签（复数）|more than one tag.|The clothes all have price tags; The animals are tagged for identification.|labels|n.
tagus: /ˈteɪɡəs/|塔霍河|a river in Spain and Portugal|Tagus River flows to Atlantic Ocean|river name||n.
tail: /teɪl/|尾巴，尾部|the hindmost part of an animal; the rear part of something.|The dog wagged its tail,; the tail of the plane.|end, rear|head, front|n.
tailed: /teɪld/|有尾巴的|having a tail.|A tailed beast; The airplane was tailed.|caudal|tailless|adj.
tailored: /ˈteɪlərd/|量身定做的，定制的|made or adapted for a particular purpose or person.|The dress was tailored to fit her perfectly; The course was tailored to meet the needs of the students.|customized, fitted|generic, standard|adj.
tails: /teɪlz/|尾巴（复数），尾部（复数）|more than one tail; the rear part.|The cat has long tails; The tails of the plane.|ends, rears|n.
tain: /teɪn/|沾污，使腐败|to spoil or contaminate; to infect, corrupt, or injure (something or someone) morally or aesthetically.|The food was tainted; His reputation was tainted.|contaminate, corrupt|purify, cleanse|v.
taint: /teɪnt/|污点，瑕疵，败坏|a trace of a bad or undesirable substance or quality; a corrupting influence.|The scandal left a taint on his reputation; There is a taint of bitterness in the aftertaste.|blemish, stain|purity, honor|n.
taiping: /ˈtaɪˈpɪŋ/|太平天国|a large-scale rebellion or civil war in China that lasted from 1850 to 1864|The Taiping Rebellion is important in Chinese history|rebellion||n.
taism: /ˈtaʊɪzəm/|道教|a Chinese philosophy and religion based on the teachings of Lao Tzu|Taoism emphasizes living in harmony with nature|Taoism|other religion|n.
taiwan: /ˈtaɪˈwɑːn/|台湾|an island in the western Pacific Ocean|Taiwan is located to the southeast of China|island name||n.
taiwanese: /ˌtaɪwəˈniːz/|台湾的，台湾人|relating to Taiwan, or its people.|He is a Taiwanese; The Taiwanese government|Taiwanese|non-Taiwanese|adj., n.
tajikistan: /tɑːˈdʒiːkɪˌstɑːn/|塔吉克斯坦|a country in Central Asia|Tajikistan shares borders with Afghanistan.|country name||n.
takash: |高桥|a Japanese name|Takashi is a common Japanese name|name||n.
takayama: /tɑːkəˈjɑːmə/|高山（日本城市名）|a city in the Gifu Prefecture of Japan|Takayama is famous for its old town.|place name||n.
take: /teɪk/|拿，取|to lay hold of; to get into one's possession|Take the book; take a break|get, obtain|give, leave|v.
takeaway: /ˈteɪkəˌweɪ/|外卖，要点|food that is cooked and bought at a restaurant but eaten somewhere else; a key point.|I ordered a takeaway, the main takeaway from the speech is that we should be optimistic|take-out, summary|eat-in, full speech|n.
taken: /ˈteɪkən/|拿走的，被拍摄的|past participle of take; removed or photographed.|The book was taken, The photo was taken last week.|removed, captured|given, left|v.
takeoff: /ˈteɪkˌɔːf/|起飞，开始|the moment when an aircraft leaves the ground; the start of an activity.|The takeoff was smooth; The company is preparing for the takeoff of a new project.|departure, start|landing, end|n.
takeover: /ˈteɪkˌoʊvər/|接管，收购|the act of assuming control of something, especially a company|The company is facing a takeover; The new manager took over the project|acquisition, assumption|surrender, relinquish|n.
taker: /ˈteɪkər/|接受者，拿走者|someone who takes or accepts something|He is a risk-taker, he is a taker of money.|receiver, consumer|giver, provider|n.
takes: /teɪks/|拿，取（第三人称单数）|third person singular present of take.|He takes the bus to work; She takes a walk in the park every day.|gets, obtains|gives, leaves|v.
taking: /ˈteɪkɪŋ/|拿，取（现在分词）|present participle of take.|He is taking the exam; She is taking care of her child.|getting, obtaining|giving, leaving|v.
tale: /teɪl/|故事，传说|a narrative that tells a story; a fictional account.|The old man told a tale of his youth; The newspaper published a shocking tale of betrayal.|story, narrative|fact, truth|n.
talena: |塔莱娜（人名）|a name|Talena is a beautiful name|name||n.
talent: /ˈtælən̩t/|才能，天赋|natural aptitude or skill.|She has a talent for singing; He has a talent for science.|ability, gift|inability, ineptitude|n.
talented: /ˈtæləntɪd/|有才能的，有天赋的|having a natural aptitude or skill.|He is a talented musician; She is a talented writer.|gifted, skilled|untalented, unskilled|adj.
talentia: |天才（拉丁语）|latin word for talent|Talentia is from the latin word for talent|talent||n.
talents: /ˈtælən̩ts/|才能（复数），天赋（复数）|more than one talent.|He has many talents; They have different talents.|abilities, gifts|n.
tales: /teɪlz/|故事（复数），传说（复数）|more than one tale.|The book contains many tales; The stories were not tales of fantasy but reality.|stories, narratives|n.
taliban: /ˈtælɪˌbæn/|塔利班|a militant fundamentalist Islamic movement in Afghanistan|The Taliban is infamous for their harsh laws.|militant group||n.
talk: /tɔːk/|谈话，演讲|the action of speaking; a conversation; a speech.|They had a talk; He gave a talk on history.|conversation, speech|silence|v., n.
talked: /tɔːkt/|谈话，演讲（过去式）|past tense of talk.|They talked for hours; He talked about his travel experiences.|conversed, spoke|n., v.
talking: /ˈtɔːkɪŋ/|谈话，演讲（现在分词）|present participle of talk.|They are talking about the weather; He is talking to a customer.|conversing, speaking|v.
talks: /tɔːks/|谈话（复数），演讲（复数）|more than one talk; third person present singular of talk.|The meeting consisted of several talks; He talks too much|conversations, speeches|v., n.
tall: /tɔːl/|高的|of great or more than average height.|He is a tall man; The building is very tall.|high, elevated|short, low|adj.
taller: /ˈtɔːlər/|更高的|comparative of tall.|He is taller than his brother; The building is taller than the other ones.|higher|shorter|adj.
talleri: |塔勒里（人名）|a name|Talleri is a less common name|name||n.
tallest: /ˈtɔːlɪst/|最高的|superlative of tall.|He is the tallest in the class; It is the tallest building in the city.|highest|shortest|adj.
tally: /ˈtæli/|计数，计算|count something, keep count of something|Tally the scores; they tallied up the expenses.|count, calculate|miscount, undercount|v., n.
talon: /ˈtælən/|爪|a claw, especially of a bird of prey.|The hawk has sharp talons; The eagle's talon was hooked.|claw, nail|n.
talons: /ˈtælənz/|爪（复数）|more than one talon.|The owl’s talons are very sharp; The bird of prey had strong talons.|claws, nails|n.
tam: /tæm/|（苏格兰语）贝雷帽|a scottish hat|He wore a tam|hat|no hat|n.
tame: /teɪm/|驯服的，温顺的|not wild; trained to obey people; make (an animal) docile.|The lion was tame; They tried to tame the wild horses; The animal was tamed.|domesticated, docile, subdue|wild, untamed|adj., v.
tamed: /teɪmd/|驯服的（过去式）|past tense of tame.|The animals were tamed; The horse was tamed.|domesticated, subdued|wild, untamed|v.
tami: |塔米（人名）|a name|Tami is a common name in some cultures|name||n.
tamil: /ˈtæmɪl/|泰米尔语，泰米尔人|a Dravidian language spoken in south India and Sri Lanka; relating to or of the Tamil language or people|Tamil is an ancient language; He is a Tamil speaker.|Tamil|non-Tamil|n., adj.
tamper: /ˈtæmpər/|干预，篡改|interfere with something in order to damage or alter it.|Someone tampered with the lock; He was accused of tampering with evidence|interfere, meddle|leave alone, protect|v.
tampering: /ˈtæmpərɪŋ/|干预，篡改（现在分词）|present participle of tamper.|He was arrested for tampering with the meter; They suspect tampering with the evidence.|interference, meddling|v.
tamur: |塔穆尔（人名）|a name|Tamur is an uncommon name|name||n.
tan: /tæn/|棕褐色，晒黑|a light brown color; a darkened skin color.|She has a nice tan; The leather is a tan color; She tanned in the sun.|brown, bronze|pale, white|n., v., adj.
tanaki: |田中（姓氏）|a japanese surname|Tanaka is a common Japanese surname|name||n.
tanaman: |塔纳曼（人名）|a name|Tanaman is a rare name|name||n.
tanar: |塔纳尔（人名）|a name|Tanar is an uncommon name|name||n.
tang: /tæŋ/|（强烈的）味道，意味|a strong taste, flavour, or smell|The sauce had a tangy flavor; There was a tang of salt in the air.|flavor, scent, edge, sharpness|blandness, dullness|n.
tanganika: /ˌtæŋɡəˈniːkə/|坦噶尼喀|a former name of an East African country|Lake Tanganyika is an important feature of the country|place name||n.
tangent: /ˈtændʒənt/|切线，离题|a straight line touching a curve at a single point; a digression from a subject.|The line is a tangent to the circle; he went off on a tangent during the meeting.|deviation, digression|focus, directness|n.
tangents: /ˈtændʒən̩ts/|切线（复数），离题（复数）|more than one tangent.|The teacher drew several tangents; The conversation went off on many tangents.|deviations, digressions|n.
tangerism: |橘子主义|a word for describing a kind of political leaning|tangerism is a word used in politics|political term||n.
tangible: /ˈtændʒəbl̩/|有形的，可感知的|perceptible by touch; clear and definite.|The results were tangible; the problem is tangible|touchable, palpable|intangible, abstract|adj.
