endlessly: /ˈɛndləsli/|无休止地，不停地|adverb, in a never-ending way|The movie seemed to go on endlessly.|perpetually, incessantly|temporarily, briefly|adv.
endor: /ˈɛndɔːr/|背书，认可|verb, to approve or support (something)|The council did not endorse the proposal.|approve, support|disapprove, reject|v.
endorsed: /ɪnˈdɔːrst/|被认可的，被支持的|verb (past tense), to have approved or supported (something)|The plan was endorsed by the committee.|approved, supported|rejected, opposed|v.
endorsement: /ɪnˈdɔːrsmənt/|认可，支持|noun, an act of giving one's public approval or support to someone or something|The product received a celebrity endorsement.|approval, support|disapproval, rejection|n.
endpoint: /ˈɛndpɔɪnt/|终点，端点|noun, a final point in a process or a location|The endpoint of the project is next month.|conclusion, finish|beginning, start|n.
ends: /ɛndz/|末端，目标|noun (plural) the final part of something; the purpose for which something is done|The ends justify the means, they say. He has his own ends. |limits, purpose|beginnings, sources|n.
endurance: /ɪnˈdjʊərəns/|耐力，忍耐力|noun, the ability to withstand hardship or stress|Marathon runners need a lot of endurance.|stamina, fortitude|weakness, frailty|n.
endure: /ɪnˈdjʊər/|忍受，持续|verb, to suffer (something painful or difficult) patiently; to continue to exist|She had to endure a lot of pain. They endured through many hardships.|withstand, persevere|fail, give in|v.
endured: /ɪnˈdjʊərd/|忍受了，持续了|verb (past tense), to have suffered (something painful or difficult) patiently; to have continued to exist|The building has endured for centuries.|withstood, persevered|failed, given in|v.
endures: /ɪnˈdjʊərz/|忍受，持续|verb (present tense), to suffer (something painful or difficult) patiently; to continue to exist|The family endures many challenges. Their love endures.|withstands, perseveres|fails, gives in|v.
enduring: /ɪnˈdjʊərɪŋ/|持久的，持续的|adjective, lasting over a period of time|Their love is an enduring love. He left an enduring impression.|lasting, permanent|fleeting, temporary|adj.
enemies: /ˈɛnəmiz/|敌人|noun (plural), people who are actively hostile to someone|He has made many enemies in his life. The two nations have been enemies for decades.|adversaries, rivals|friends, allies|n.
enemy: /ˈɛnəmi/|敌人|noun, a person who is actively hostile to someone|He regarded his former friend as an enemy.|adversary, rival|friend, ally|n.
energetic: /ˌɛnərˈdʒɛtɪk/|精力充沛的，有活力的|adjective, having or showing a lot of energy|He is a very energetic child.|active, lively|lethargic, passive|adj.
energies: /ˈɛnərdʒiz/|能量，精力|noun (plural), the strength and vitality required for sustained physical or mental activity|She directed all her energies into the project.|vitality, power|lethargy, weakness|n.
energy: /ˈɛnərdʒi/|能量，精力|noun, the strength and vitality required for sustained physical or mental activity|He has a lot of energy. |vitality, power|lethargy, weakness|n.
enforce: /ɪnˈfɔːrs/|执行，实施|verb, to compel observance of or compliance with (a law, rule, or obligation)|The police enforce the law.|implement, apply|ignore, neglect|v.
enforced: /ɪnˈfɔːrst/|被执行的，被实施的|verb (past tense), to have compelled observance of or compliance with (a law, rule, or obligation)|The new rules were strictly enforced.|implemented, applied|ignored, neglected|v.
enforcement: /ɪnˈfɔːrsmənt/|执行，实施|noun, the act of compelling observance of or compliance with (a law, rule, or obligation)|Law enforcement is essential for a safe society.|implementation, application|neglect, violation|n.
enforcements: /ɪnˈfɔːrsmənts/|执行，实施 (复数)|noun (plural), instances of the act of compelling observance of or compliance with (a law, rule, or obligation)|There have been several enforcements of the new policy.|implementations, applications|neglects, violations|n.
enforcing: /ɪnˈfɔːrsɪŋ/|执行，实施|verb (present participle), compelling observance of or compliance with (a law, rule, or obligation)|The police are enforcing the speed limit.|implementing, applying|ignoring, neglecting|v.
eng: /ɛŋ/|工程 (缩写)|noun, abbreviation for engineering or engine|He's a graduate in Eng.|engineering, engine|-|n.
engage: /ɪnˈɡeɪdʒ/|参与，订婚|verb, to participate or become involved in; to become formally committed to marry|She wanted to engage in the project. They got engaged last month.|participate, involve|disengage, detach|v.
engaged: /ɪnˈɡeɪdʒd/|已订婚的，参与的|adjective/verb (past tense), having formally committed to marry; to have participated or become involved in|They are engaged to be married. He was fully engaged in his work.|committed, involved|disengaged, detached|adj/v.
engagement: /ɪnˈɡeɪdʒmənt/|订婚，参与|noun, a formal agreement to get married; the act of participating or becoming involved|They announced their engagement. His engagement with the issue was commendable.|commitment, involvement|disengagement, detachment|n.
engagements: /ɪnˈɡeɪdʒmənts/|订婚，约会，参与 (复数)|noun (plural), formal agreements to get married; the act of participating or becoming involved; appointments or scheduled activities|She had several engagements that week.|commitments, appointments|disengagements|n.
engaging: /ɪnˈɡeɪdʒɪŋ/|迷人的，引人入胜的|adjective, charming and attractive|He has an engaging personality.|charming, attractive|repulsive, dull|adj.
engelbert: /ˈɛndʒəlbərt/|恩格尔伯特（人名）|proper noun, a masculine given name.|Engelbert Humperdinck is a famous singer.| - |- |pn.
engels: /ˈɛŋɡəlz/|恩格斯（人名）|proper noun, a family name.|Karl Marx and Friedrich Engels were famous philosophers.| - |- |pn.
engine: /ˈɛndʒɪn/|引擎，发动机|noun, a machine with moving parts that converts power into motion|The engine of the car is very powerful.|motor, machine| - |n.
engineer: /ˌɛndʒɪˈnɪr/|工程师|noun/verb, a person who designs, builds, or maintains engines, machines, or public works; to design and build|He is an engineer for a major firm. The project is being engineered by experienced professionals.|designer, builder| - |n/v.
engineered: /ˌɛndʒɪˈnɪrd/|被设计的，被建造的|verb (past tense), to have designed and built something, often in a skillful way|The bridge was engineered to withstand high winds.|designed, built| - |v.
engineering: /ˌɛndʒɪˈnɪrɪŋ/|工程，工程学|noun, the branch of science and technology concerned with the design, building, and use of engines, machines, and structures|He is studying mechanical engineering.|construction, design| - |n.
engineers: /ˌɛndʒɪˈnɪrz/|工程师 (复数)|noun (plural), people who design, build, or maintain engines, machines, or public works|The project was completed by a team of experienced engineers.|designers, builders| - |n.
engines: /ˈɛndʒɪnz/|引擎，发动机 (复数)|noun (plural), machines with moving parts that convert power into motion|The factory has several large engines.|motors, machines| - |n.
england: /ˈɪŋɡlənd/|英格兰|proper noun, the largest and most populous country in the United Kingdom|She is from England.| - |- |pn.
englis:  /ˈɪŋɡlɪʃ/|英语 (过时的拼写方式, 已不常用)|-|-|-| - |-
english: /ˈɪŋɡlɪʃ/|英语|noun/adjective, the language of England and widely spoken in many other countries; of or relating to England or the English language|He speaks English fluently. She has English heritage.|language, British| - |n/adj.
englishback: /ˈɪŋɡlɪʃbæk/|英式后旋球|noun, a backward spin of a ball|The ball had a lot of englishback.||-|-|n.
englishman: /ˈɪŋɡlɪʃmən/|英国男人|noun, a man from England|He is a proud Englishman.|Brit, man from England| - |n.
engrave: /ɪnˈɡreɪv/|雕刻|verb, to cut or carve a design on a hard surface|They engraved the trophy with the winner's name.|carve, etch| - |v.
engraving: /ɪnˈɡreɪvɪŋ/|雕刻，版画|noun, a print made from an engraved plate|The museum has a collection of old engravings.|carving, etching| - |n.
engrossed: /ɪnˈɡroʊst/|全神贯注的|adjective, having all one's attention or interest absorbed by someone or something|She was engrossed in the book.|absorbed, captivated|distracted, bored|adj.
engulfed: /ɪnˈɡʌlft/|吞没的|verb (past tense), to have swept over or completely surrounded (something)|The flames engulfed the building. The flood engulfed the town.|surrounded, overwhelmed| - |v.
engulfing: /ɪnˈɡʌlfɪŋ/|吞没，包围|verb (present participle), to sweep over or completely surround (something)|The smoke was engulfing the car.|surrounding, overwhelming| - |v.
enhance: /ɪnˈhæns/|提高，增强|verb, to improve the quality, amount, or strength of (something)|They want to enhance the company’s image. |improve, augment|reduce, diminish|v.
enhanced: /ɪnˈhænst/|增强的|verb (past tense), to have improved the quality, amount, or strength of (something)|The software has been significantly enhanced.|improved, augmented|reduced, diminished|v.
enhancements: /ɪnˈhænsmənts/|增强，改进 (复数)|noun (plural), improvements or additions to something|The software upgrade includes several enhancements.|improvements, additions|reductions, diminutions|n.
enhances: /ɪnˈhænsɪz/|提高，增强|verb (present tense), to improve the quality, amount, or strength of (something)|The new software enhances the user experience.|improves, augments|reduces, diminishes|v.
enhancing: /ɪnˈhænsɪŋ/|提高，增强|verb (present participle), to improve the quality, amount, or strength of (something)|They are enhancing the safety features of the car.|improving, augmenting|reducing, diminishing|v.
enig: /-|-| - |-
enigma: /ɪˈnɪɡmə/|谜|noun, a person or thing that is mysterious, puzzling, or difficult to understand|She is an enigma to everyone.|mystery, puzzle|clarity, explanation|n.
enim: /-|-| - |-
enjoy: /ɪnˈdʒɔɪ/|享受，喜欢|verb, to take pleasure in (something)|I enjoy reading.|like, appreciate|dislike, hate|v.
enjoyable: /ɪnˈdʒɔɪəbl/|令人愉快的|adjective, giving pleasure|The party was very enjoyable.|pleasant, delightful|unpleasant, boring|adj.
enjoyed: /ɪnˈdʒɔɪd/|享受了，喜欢了|verb (past tense), to have taken pleasure in (something)|We enjoyed the vacation very much.|liked, appreciated|disliked, hated|v.
enjoying: /ɪnˈdʒɔɪɪŋ/|享受，喜欢|verb (present participle), taking pleasure in (something)|They are enjoying the concert.|liking, appreciating|disliking, hating|v.
enjoyment: /ɪnˈdʒɔɪmənt/|享受，乐趣|noun, the state or process of taking pleasure in something|The children get great enjoyment from playing outdoors.|pleasure, delight|displeasure, boredom|n.
enlightened: /ɪnˈlaɪtənd/|开明的，被启发的|adjective, having or showing a rational, modern, and well-informed outlook|He is an enlightened thinker.|informed, aware|ignorant, narrow-minded|adj.
enlightenment: /ɪnˈlaɪtnmənt/|启蒙，开明|noun, the action of enlightening or the state of being enlightened|The book is about the Enlightenment.|awareness, insight|ignorance, misunderstanding|n.
enlisted: /ɪnˈlɪstɪd/|被征募的，入伍的|verb (past tense), to have enrolled or been enrolled in the armed services|He enlisted in the army after high school.|joined, enrolled|left, deserted|v.
enlisting: /ɪnˈlɪstɪŋ/|征募，入伍|verb (present participle), to enroll or be enrolled in the armed services|He is enlisting in the Air Force.|joining, enrolling|leaving, deserting|v.
enmities: /ˈɛnmətiz/|敌意，仇恨 (复数)|noun (plural), the state or feeling of being actively opposed or hostile to someone|The war was the result of old enmities between the two countries.|hostilities, animosities|friendships, alliances|n.
eno:  /ˈiːnoʊ/|埃诺 (人名)|-|- |- |-
enor: /-|-| - |-
enormous: /ɪˈnɔːrməs/|巨大的|adjective, very large in size, quantity, or extent|The building is enormous.|huge, immense|tiny, small|adj.
enormously: /ɪˈnɔːrməsli/|非常地，巨大地|adverb, to a very great extent|They are enormously popular.|greatly, immensely|slightly, minimally|adv.
enough: /ɪˈnʌf/|足够的|adjective/pronoun/adverb, as much or as many as required; sufficient|I have enough money. Is this enough? That's enough!|sufficient, adequate|insufficient, inadequate|adj/pron/adv.
enraged: /ɪnˈreɪdʒd/|激怒的|adjective, very angry; furious|She was enraged by his comments.|furious, incensed|pleased, calm|adj.
enriching: /ɪnˈrɪtʃɪŋ/|使丰富，使富裕|verb (present participle), to improve or enhance the quality or value of (something); to make wealthy|Travel can be an enriching experience. Education is enriching the lives of many people.|improving, enhancing|degrading, impoverishing|v.
enrichment: /ɪnˈrɪtʃmənt/|丰富，充实|noun, the action of improving or enhancing the quality or value of something|His travels provided him with great enrichment.|improvement, enhancement|degradation, impoverishment|n.
enrique: /ɛnˈriːkeɪ/|恩里克（人名）|proper noun, a masculine given name.|Enrique Iglesias is a well-known singer.|- |- |pn.
enroll: /ɪnˈroʊl/|注册，登记|verb, to officially register as a member of a course, school, or organization|He wants to enroll in the university.|register, sign up|withdraw, drop out|v.
enrolled: /ɪnˈroʊld/|已注册的，已登记的|verb (past tense), to have officially registered as a member of a course, school, or organization|She enrolled in the class. |registered, signed up|withdrawn, dropped out|v.
enrolling: /ɪnˈroʊlɪŋ/|注册，登记|verb (present participle), officially registering as a member of a course, school, or organization|They are enrolling their children in school.|registering, signing up|withdrawing, dropping out|v.
enron: /ˈɛnrɒn/|安然 (公司名)|proper noun, a company name known for its infamous scandal|Enron was a huge energy company.| - |- |pn.
ensconcing: /ɛnˈskɒnsɪŋ/|安顿，安置|verb (present participle), to settle (someone or something) comfortably and securely|She was ensconcing herself in the chair.|settling, lodging|dislodging, disturbing|v.
enshrined: /ɪnˈʃraɪnd/|被奉为神圣的，被珍藏的|verb (past tense), to have preserved (a right, tradition, or idea) as valued or important|The constitution enshrines certain rights. |preserved, honored|neglected, ignored|v.
enslave: /ɪnˈsleɪv/|奴役|verb, to make (someone) a slave|The war enslaved many people.|subjugate, dominate|free, liberate|v.
enslaved: /ɪnˈsleɪvd/|被奴役的|verb (past tense), to have made (someone) a slave|They were enslaved for many years.|subjugated, dominated|freed, liberated|v.
enslavement: /ɪnˈsleɪvmənt/|奴役|noun, the action of enslaving someone or the state of being enslaved|His book details the horrors of enslavement. |subjugation, domination|freedom, liberation|n.
ensued: /ɪnˈsjuːd/|接着发生，随之而来|verb (past tense), to have happened afterward or as a result|The argument ensued after their comments.|followed, resulted|preceded, caused|v.
ensues: /ɪnˈsjuːz/|接着发生，随之而来|verb (present tense), to happen afterward or as a result|A fight ensues when the two meet. |follows, results|precedes, causes|v.
ensuing: /ɪnˈsjuːɪŋ/|随后的|adjective, happening or occurring afterward or as a result|The ensuing chaos caused panic. |following, subsequent|preceding, prior|adj.
ensure: /ɪnˈʃʊr/|确保，保证|verb, to make certain that (something) will occur or be the case|Please ensure that all doors are locked.|guarantee, assure|doubt, risk|v.
ensured: /ɪnˈʃʊrd/|确保了，保证了|verb (past tense), to have made certain that (something) would occur or be the case|She ensured that everything was ready.|guaranteed, assured|doubted, risked|v.
ensures: /ɪnˈʃʊrz/|确保，保证|verb (present tense), to make certain that (something) will occur or be the case|The new law ensures equal rights for all.|guarantees, assures|doubts, risks|v.
ensuring: /ɪnˈʃʊərɪŋ/|确保，保证|verb (present participle), making certain that (something) will occur or be the case|They are ensuring the safety of the passengers.|guaranteeing, assuring|doubting, risking|v.
ent: /ɛnt/|树人 (虚构生物)|noun, a fictional, tree-like creature from J.R.R. Tolkien's "The Lord of the Rings"|The ents marched to war.| - |- |n.
entail: /ɪnˈteɪl/|使成为必要，牵涉|verb, to involve (something) as a necessary or inevitable part or consequence|The job entails a lot of travel. |involve, require|exclude, preclude|v.
entailed: /ɪnˈteɪld/|使成为必要的，牵涉的|verb (past tense), to have involved (something) as a necessary or inevitable part or consequence|The plan entailed spending a lot of money.|involved, required|excluded, precluded|v.
entangle: /ɪnˈtæŋɡəl/|使缠结，使陷入|verb, to cause to become twisted together with or caught in|The net entangled the fish.|tangle, ensnare|free, release|v.
entangled: /ɪnˈtæŋɡəld/|缠结的，陷入的|verb (past tense), to have become twisted together with or caught in|The rope was entangled in the branches.|tangled, ensnared|free, released|v.
entanglement: /ɪnˈtæŋɡəlmənt/|缠结，纠葛|noun, the action or state of becoming tangled in something|The police are trying to unravel the entanglement of lies. |complication, involvement|clarity, simplicity|n.
entanglements: /ɪnˈtæŋɡəlmənts/|缠结，纠葛 (复数)|noun (plural), instances of the action or state of becoming tangled in something|He had many entanglements with the law.|complications, involvements|clarities, simplicities|n.
enter: /ˈɛntər/|进入，输入|verb, to come or go into (a place)|Please enter the room quietly. I need to enter the code.|go in, join|exit, leave|v.
entered: /ˈɛntərd/|进入了，输入了|verb (past tense), to have come or gone into (a place)|She entered the building. He entered the data into the computer. |gone in, joined|exited, left|v.
entering: /ˈɛntərɪŋ/|进入，输入|verb (present participle), coming or going into (a place)|They are entering the competition. They are entering the information.|going in, joining|exiting, leaving|v.
enterprise: /ˈɛntərpraɪz/|企业，事业|noun, a project or undertaking, especially a bold or complex one; a business or company|The company is a successful enterprise.|project, venture, company| - |n.
enterprises: /ˈɛntərpraɪzɪz/|企业，事业 (复数)|noun (plural), projects or undertakings, especially bold or complex ones; businesses or companies|Small enterprises are important for the economy.|projects, ventures, companies| - |n.
